app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "{\"title\"=>\"Rails Introduction ccc\", \"description\"=>\"dfgehwrthrwh\"}"], ["updated_at", "2019-03-16 17:45:38.882591"], ["id", 2]]
---
	def update
		@post = Post.find(params[:id])
		@post.update(title: params.require(:post)[:title], description: params.require(:post)[:description])